---
kind: type
id: T:Autodesk.Revit.DB.Structure.YZJustificationOption
source: html/f569aef8-8c20-1a52-cccc-31e17d2e623d.htm
---
# Autodesk.Revit.DB.Structure.YZJustificationOption

The option for whether a framing element has independent or uniform justification on its ends.

## Syntax (C#)
```csharp
public enum YZJustificationOption
```